In [37]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [44]:
data=pd.read_csv("train.csv")

# filling missing data with last valid observation
data = data.fillna(method='ffill')
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   C85         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500  C123         S

[5 rows x 12 columns]

In [45]:
Y= data["Survived"]

In [47]:
data=data.drop(["Survived","Name","Ticket","Cabin"], axis = 1)

In [48]:
data

     PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0              1       3    male  22.0      1      0   7.2500        S
1              2       1  female  38.0      1      0  71.2833        C
2              3       3  female  26.0      0      0   7.9250        S
3              4       1  female  35.0      1      0  53.1000        S
4              5       3    male  35.0      0      0   8.0500        S
..           ...     ...     ...   ...    ...    ...      ...      ...
886          887       2    male  27.0      0      0  13.0000        S
887          888       1  female  19.0      0      0  30.0000        S
888          889       3  female  19.0      1      2  23.4500        S
889          890       1    male  26.0      0      0  30.0000        C
890          891       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [49]:
from sklearn.preprocessing import OneHotEncoder 
from sklearn.compose import make_column_transformer
column_trans=make_column_transformer(
    (OneHotEncoder(),['Pclass','Sex','Embarked'] ),
    remainder ='passthrough'
)

In [50]:
a=column_trans.fit_transform(data)

In [51]:
print(a[1,:])

[ 1.      0.      0.      1.      0.      1.      0.      0.      2.
 38.      1.      0.     71.2833]

In [ ]:
# feature_list=["pclass1","pclass2","pclass3",	"male",	"female",	"em1",	"em2","em3",	"SibSp",	"Parch",	"x1",	"y1","fare"]

In [52]:
split_ratio = int(len(data)*0.75)

x_train =a[0:split_ratio] 
# np.array(a[:].iloc[0:split_ratio])
y_train = np.array(Y.iloc[0:split_ratio])

x_test  = a[split_ratio:] 
y_test  = np.array(Y.iloc[split_ratio:])

In [53]:
x_test

array([[ 0.  ,  0.  ,  1.  , ...,  0.  ,  0.  ,  8.05],
       [ 1.  ,  0.  ,  0.  , ...,  1.  ,  0.  , 52.  ],
       [ 0.  ,  1.  ,  0.  , ...,  1.  ,  1.  , 39.  ],
       ...,
       [ 0.  ,  0.  ,  1.  , ...,  1.  ,  2.  , 23.45],
       [ 1.  ,  0.  ,  0.  , ...,  0.  ,  0.  , 30.  ],
       [ 0.  ,  0.  ,  1.  , ...,  0.  ,  0.  ,  7.75]])

In [54]:
from sklearn.neural_network import MLPClassifier

model = MLPClassifier(solver='adam', alpha=0.01, hidden_layer_sizes=(30,20), max_iter=2500)

model.fit(x_train, y_train)

MLPClassifier(activation='relu', alpha=0.01, batch_size='auto', beta_1=0.9,
              beta_2=0.999, early_stopping=False, epsilon=1e-08,
              hidden_layer_sizes=(30, 20), learning_rate='constant',
              learning_rate_init=0.001, max_fun=15000, max_iter=2500,
              momentum=0.9, n_iter_no_change=10, nesterovs_momentum=True,
              power_t=0.5, random_state=None, shuffle=True, solver='adam',
              tol=0.0001, validation_fraction=0.1, verbose=False,
              warm_start=False)

In [55]:
from sklearn.metrics import accuracy_score

x_train_pred = model.predict(x_train)
x_test_pred = model.predict(x_test)

print("Training accuracy: ",accuracy_score(y_train, x_train_pred))
print("Testing accuracy: ",accuracy_score(y_test, x_test_pred))

Training accuracy:  0.8008982035928144
Testing accuracy:  0.7623318385650224

In [56]:
test_data = pd.DataFrame(pd.read_csv('test.csv'))

In [69]:
test_data = test_data.fillna(method='ffill')
test_data.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0          892       3    male  34.5      0      0   7.8292        Q
1          893       3  female  47.0      1      0   7.0000        S
2          894       2    male  62.0      0      0   9.6875        Q
3          895       3    male  27.0      0      0   8.6625        S
4          896       3  female  22.0      1      1  12.2875        S

In [ ]:
test_data=test_data.drop(["Name","Ticket","Cabin"], axis = 1)

In [71]:
test_data

     PassengerId  Pclass     Sex   Age  SibSp  Parch      Fare Embarked
0            892       3    male  34.5      0      0    7.8292        Q
1            893       3  female  47.0      1      0    7.0000        S
2            894       2    male  62.0      0      0    9.6875        Q
3            895       3    male  27.0      0      0    8.6625        S
4            896       3  female  22.0      1      1   12.2875        S
..           ...     ...     ...   ...    ...    ...       ...      ...
413         1305       3    male  28.0      0      0    8.0500        S
414         1306       1  female  39.0      0      0  108.9000        C
415         1307       3    male  38.5      0      0    7.2500        S
416         1308       3    male  38.5      0      0    8.0500        S
417         1309       3    male  38.5      1      1   22.3583        C

[418 rows x 8 columns]

In [72]:
from sklearn.preprocessing import OneHotEncoder 
from sklearn.compose import make_column_transformer
column_trans=make_column_transformer(
    (OneHotEncoder(),['Pclass','Sex','Embarked'] ),
    remainder ='passthrough'
)

In [74]:
b=column_trans.fit_transform(test_data)

In [75]:
print(b[1,:])

[  0.   0.   1.   1.   0.   0.   0.   1. 893.  47.   1.   0.   7.]

In [77]:
test_pred = model.predict(b)

In [78]:
pred_list = [['PassengerId', 'Survived']]

for i in range(len(test_pred)):
    pred_list.append([test_data['PassengerId'][i], test_pred[i]])

In [79]:
import csv

with open("test_prediction.csv","w+") as my_csv:
    csvWriter = csv.writer(my_csv,delimiter=',')
    csvWriter.writerows(pred_list)